###################################################################

# Created by write_sdc on Sun Dec 18 15:21:05 2016

###################################################################
set sdc_version 2.0

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_max_area 0
create_clock [get_ports clk]  -period 3.84  -waveform {0 1.92}
set_input_delay -clock clk  1  [get_ports Start]
set_input_delay -clock clk  1  [get_ports {R[7]}]
set_input_delay -clock clk  1  [get_ports {R[6]}]
set_input_delay -clock clk  1  [get_ports {R[5]}]
set_input_delay -clock clk  1  [get_ports {R[4]}]
set_input_delay -clock clk  1  [get_ports {R[3]}]
set_input_delay -clock clk  1  [get_ports {R[2]}]
set_input_delay -clock clk  1  [get_ports {R[1]}]
set_input_delay -clock clk  1  [get_ports {R[0]}]
set_input_delay -clock clk  1  [get_ports {S1[7]}]
set_input_delay -clock clk  1  [get_ports {S1[6]}]
set_input_delay -clock clk  1  [get_ports {S1[5]}]
set_input_delay -clock clk  1  [get_ports {S1[4]}]
set_input_delay -clock clk  1  [get_ports {S1[3]}]
set_input_delay -clock clk  1  [get_ports {S1[2]}]
set_input_delay -clock clk  1  [get_ports {S1[1]}]
set_input_delay -clock clk  1  [get_ports {S1[0]}]
set_input_delay -clock clk  1  [get_ports {S2[7]}]
set_input_delay -clock clk  1  [get_ports {S2[6]}]
set_input_delay -clock clk  1  [get_ports {S2[5]}]
set_input_delay -clock clk  1  [get_ports {S2[4]}]
set_input_delay -clock clk  1  [get_ports {S2[3]}]
set_input_delay -clock clk  1  [get_ports {S2[2]}]
set_input_delay -clock clk  1  [get_ports {S2[1]}]
set_input_delay -clock clk  1  [get_ports {S2[0]}]
set_output_delay -clock clk  1  [get_ports {AddressS1[9]}]
set_output_delay -clock clk  1  [get_ports {AddressS1[8]}]
set_output_delay -clock clk  1  [get_ports {AddressS1[7]}]
set_output_delay -clock clk  1  [get_ports {AddressS1[6]}]
set_output_delay -clock clk  1  [get_ports {AddressS1[5]}]
set_output_delay -clock clk  1  [get_ports {AddressS1[4]}]
set_output_delay -clock clk  1  [get_ports {AddressS1[3]}]
set_output_delay -clock clk  1  [get_ports {AddressS1[2]}]
set_output_delay -clock clk  1  [get_ports {AddressS1[1]}]
set_output_delay -clock clk  1  [get_ports {AddressS1[0]}]
set_output_delay -clock clk  1  [get_ports {AddressS2[9]}]
set_output_delay -clock clk  1  [get_ports {AddressS2[8]}]
set_output_delay -clock clk  1  [get_ports {AddressS2[7]}]
set_output_delay -clock clk  1  [get_ports {AddressS2[6]}]
set_output_delay -clock clk  1  [get_ports {AddressS2[5]}]
set_output_delay -clock clk  1  [get_ports {AddressS2[4]}]
set_output_delay -clock clk  1  [get_ports {AddressS2[3]}]
set_output_delay -clock clk  1  [get_ports {AddressS2[2]}]
set_output_delay -clock clk  1  [get_ports {AddressS2[1]}]
set_output_delay -clock clk  1  [get_ports {AddressS2[0]}]
set_output_delay -clock clk  1  [get_ports {AddressR[7]}]
set_output_delay -clock clk  1  [get_ports {AddressR[6]}]
set_output_delay -clock clk  1  [get_ports {AddressR[5]}]
set_output_delay -clock clk  1  [get_ports {AddressR[4]}]
set_output_delay -clock clk  1  [get_ports {AddressR[3]}]
set_output_delay -clock clk  1  [get_ports {AddressR[2]}]
set_output_delay -clock clk  1  [get_ports {AddressR[1]}]
set_output_delay -clock clk  1  [get_ports {AddressR[0]}]
set_output_delay -clock clk  1  [get_ports {motionX[3]}]
set_output_delay -clock clk  1  [get_ports {motionX[2]}]
set_output_delay -clock clk  1  [get_ports {motionX[1]}]
set_output_delay -clock clk  1  [get_ports {motionX[0]}]
set_output_delay -clock clk  1  [get_ports {motionY[3]}]
set_output_delay -clock clk  1  [get_ports {motionY[2]}]
set_output_delay -clock clk  1  [get_ports {motionY[1]}]
set_output_delay -clock clk  1  [get_ports {motionY[0]}]
set_output_delay -clock clk  1  [get_ports {BestDist[7]}]
set_output_delay -clock clk  1  [get_ports {BestDist[6]}]
set_output_delay -clock clk  1  [get_ports {BestDist[5]}]
set_output_delay -clock clk  1  [get_ports {BestDist[4]}]
set_output_delay -clock clk  1  [get_ports {BestDist[3]}]
set_output_delay -clock clk  1  [get_ports {BestDist[2]}]
set_output_delay -clock clk  1  [get_ports {BestDist[1]}]
set_output_delay -clock clk  1  [get_ports {BestDist[0]}]
set_output_delay -clock clk  1  [get_ports completed]
